Repository: mehdi1361/backend_aghigh
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fa_ir

source: Activity
fa_ir: فعالیت

source: Title
fa_ir: عنوان

source: Slug
fa_ir: نام انگلیسی بدون فاصله

source: Department
fa_ir: محور فعالیت

source: Status
fa_ir: وضعیت

source: Max Count Activity
fa_ir: حداکثر تعداد فعالیت

source: Activity Category
fa_ir: شاخه فعالیت

source: Activity Categories
fa_ir: شاخه های فعالیت

source: Label
fa_ir: برچسب

source: Order
fa_ir: ترتیب

source: order
fa_ir: ترتیب

source: Function name
fa_ir: نام تابع

source: Function total type
fa_ir: نوع محاسبه از جمع

source: Params
fa_ir: مقادیر

source: Field type
fa_ir: نوع فیلد

source: Category
fa_ir: شاخه

source: Group
fa_ir: گروه

source: Additional Field
fa_ir: فیلد اضافه

source: Additional Fields
fa_ir: فیلدهای اضافه

source: value
fa_ir: مقدار

source: Drop Down Form Some Additional Field
fa_ir: فیلد اضافه

source: School
fa_ir: مدرسه

source: Student
fa_ir: دانش آموز

source: Checker
fa_ir: بررسی کننده

source: Category Status
fa_ir: تایید شاخه

source: Comment
fa_ir: دیدگاه

source: Title status
fa_ir: تایید عنوان

source: Location
fa_ir: مکان

source: Location status
fa_ir: تایید مکان

source: Start time date
fa_ir: زمان شروع

source: Start date status
fa_ir: تایید زمان شروع

source: End time date
fa_ir: زمان

source: End date status
fa_ir: تایید زمان پایان

source: Description
fa_ir: توضیحات

source: Description status
fa_ir: تایید توضیحات

source: Activity State
fa_ir: وضعیت فعالیت

source: Created at
fa_ir: ایجاد شده

source: Updated at
fa_ir: بروزسانی در

source: Accepted at
fa_ir: تایید شده در تاریخ

source: Vip
fa_ir: نمایش دراسلایدر

source: Point System
fa_ir: امتیاز سیستمی

source: Reject count
fa_ir: تعداد رد شدن توسط مربی

source: Gender
fa_ir: جنسیت

source: Activities
fa_ir: فعالیت ها

source: get_coach
fa_ir: مربی

source: get_student_name
fa_ir: مسؤل انجمن

source: get_school_name
fa_ir: نام مدرسه

source: get_province_name
fa_ir: نام استان

source: Address
fa_ir: آدرس

source: Accept
fa_ir: تایید شده

source: Archive
fa_ir: آرشیو

source: Download
fa_ir: دانلود و نمایش

source: FileActivity
fa_ir: فایل های فعالیت

source: ImageActivity
fa_ir: عکس های فعالیت

source: Field Name
fa_ir: نام فیلد

source: Value
fa_ir: مقدار

source: Field Status
fa_ir: وضعیت فیلد

source: Field Statuses
fa_ir: وضعیت فیلد

source: Rate
fa_ir: امتیاز

source: Rates
fa_ir: امتیازات

source: title
fa_ir: عنوان

source: Categories report
fa_ir: دسته بندی گزارش

source: Categories reports
fa_ir: دسته بندی گزارش ها

source: Report Abuse
fa_ir: گزارش سو‌‌‌‌ء استفاده

source: Report Abuses
fa_ir: گزارش های سوء استفاده

source: female
fa_ir: زن

source: male
fa_ir: مرد

source: New Activity
fa_ir: فعالیت جدید

source: Should Edit
fa_ir: در حال ویرایش توسط دانش آموز

source: Should Review
fa_ir: در حال بررسی توسط مربی

source: Temporary in league
fa_ir: بدون بررسی به لیگ رفته

source: Ban
fa_ir: عدم رعایت ضوابط

source: User
fa_ir: کاربر

source: Announcements
fa_ir: اطلاعیه ها

source: Announcement Title
fa_ir: متن اطلاعیه

source: Announcement Description
fa_ir: توضیحات اطلاعیه

source: Image
fa_ir: عکس

source: Has Date
fa_ir: در تقویم قرار گیرد؟

source: Date
fa_ir: تاریخ/زمان

source: Announcement
fa_ir: اطلاعیه

source: both
fa_ir: هر دو

source: Students
fa_ir: دانش آموزها

source: Coaches
fa_ir: مربی ها

source: Province Coach
fa_ir: مسؤلین استان ها

source: County Coach
fa_ir: مسؤلین شهرستان

source: Camp Coach
fa_ir: مسؤلین قرارگاه ها

source: Countries
fa_ir: مسولین کل

source: User Type Receiver
fa_ir: نوع گیرنده

source: Province
fa_ir: استان

source: County
fa_ir: شهر

source: Camp
fa_ir: قرارگاه

source: Announcement Receiver
fa_ir: دریافت کننده گان

source: Announcement Receivers
fa_ir: دریافت کننده گان

source: Seen at
fa_ir: دیده شده

source: File
fa_ir: فایل

source: Announcement File
fa_ir: فایل اطلاعیه

source: Announcement Files
fa_ir: فایل های اطلاعیه

source: Common
fa_ir: سیستم

source: Unsupported file extension.
fa_ir: یک فایل معتبر بارگذاری کنید.(mp3, mp4, doc, ...)

source: Version
fa_ir: ورژن

source: Message
fa_ir: پیام

source: Apk Release
fa_ir: ورژن اپلیکیشن

source: Obj
fa_ir: فایل

source: Image size
fa_ir: سایز عکس

source: Images
fa_ir: عکس ها

source: File size
fa_ir: سایز فایل

source: Files
fa_ir: فایل ها

source: Emtiaz
fa_ir: امتیاز

source: Title Param
fa_ir: عنوان پارامتر

source: Param
fa_ir: پارامتر

source: activity
fa_ir: فعالیت

source: status
fa_ir: وضعیت

source: Activity Comment
fa_ir: دیدگاه فعالیت

source: Activity Comments
fa_ir: دیدگاه فعالیت

source: activity comment
fa_ir: دیدگاه فعالیت

source: param
fa_ir: پارامتر

source: Param Activity Comment
fa_ir: امتیاز هر کامنت

source: Param Activity Comments
fa_ir: امتیاز هر کامنت

source: Sum
fa_ir: نتیجه

source: Count
fa_ir: تعداد

source: Sum Activity Param
fa_ir: مجموع امتیازات پارامترهای فعالیت

source: Sum Activity Params
fa_ir: مجموع امتیازات پارامترهای فعالیت

source: League
fa_ir: لیگ

source: Max Point
fa_ir: حداکثر امتیاز

source: Code
fa_ir: کد

source: Provinces
fa_ir: استان

source: Coach
fa_ir: مربی ها

source: Counties
fa_ir: شهرها

source: Camp County
fa_ir: قرارگاه شهر

source: Camps
fa_ir: قرارگاه ها

source: Voters
fa_ir: رای دهندگان

source: rank
fa_ir: رده

source: Student Count
fa_ir: تعداد دانش آموز

source: Anjoman Count
fa_ir: تعداد افراد انجمن

source: Point
fa_ir: امتیاز

source: Rank
fa_ir: رده

source: Province Rank
fa_ir: رده استان

source: County Rank
fa_ir: رده شهر

source: Notification
fa_ir: اعلان

source: FcmToken User
fa_ir: توکن fcm کاربر

source: Receiver
fa_ir: گیرنده

source: Seen
fa_ir: دیده شده

source: body
fa_ir: متن

source: Date Time
fa_ir: تاریخ/زمان

source: body_action
fa_ir: مکان

source: Notifications
fa_ir: اعلانات

source: Question
fa_ir: سوال

source: Advisor
fa_ir: مسولین سوالات

source: Advisor Work Table
fa_ir: میزکار

source: Advisor Work Tables
fa_ir: میزکار

source: Subject
fa_ir: موضوع

source: Answer
fa_ir: پاسخ

source: Create DateTime
fa_ir: زمان ایجاد

source: Question Base Category
fa_ir: شاخه سوال

source: Sub Category
fa_ir: محور

source: Faq Question Creator
fa_ir: ایجاد کننده سوال متداول

source: Faq Question
fa_ir: سوال متداول

source: Faq Questions
fa_ir: سوالات متداول

source: Category Code
fa_ir: شاخه

source: Question Base Categories
fa_ir: شاخه سوالات

source: Question Category
fa_ir: محور سوالات

source: Question Categories
fa_ir: محور های سوالات

source: advisor
fa_ir: کارشناس

source: expert
fa_ir: مشاور

source: top expert
fa_ir: کارشناس ارشد

source: State
fa_ir: وضعیت

source: Type
fa_ir: نوع

source: Body
fa_ir: متن

source: Create datetime
fa_ir: زمان ایجاد

source: Main Category
fa_ir: شاخه اصلی

source: View count
fa_ir: تعداد مشاهده

source: Creator
fa_ir: ایجاد کننده

source: Answer to
fa_ir: در پاسخ به

source: not allow user
fa_ir: کاربران بلاک شده

source: Questions
fa_ir: سوالات

source: Uploader
fa_ir: بارگذاری کننده

source: Uploader ip
fa_ir: آی پی بارگذاری کننده

source: Is question
fa_ir: سوال است؟

source: Reject datetime
fa_ir: زمان رد

source: Reject by
fa_ir: رد شده توسط

source: Question Reject History
fa_ir: تاریخچه رد سوال

source: Question Reject Histories
fa_ir: تاریخچه های رد سوال

source: Conversion Comment
fa_ir: دیدگاه گفتگو

source: Conversion Comments
fa_ir: دیدگاه های گفتگو

source: schedule
fa_ir: تقویم

source: date type
fa_ir: نوع تاریخ

source: day of annual
fa_ir: روز مناسبت

source: month of annual
fa_ir: ماه مناسبت

source: Annual Event
fa_ir: مناسبت سالیانه

source: Annual Events
fa_ir: مناسبتهای سالیانه

source: name
fa_ir: نام

source: slug
fa_ir: انگلیسی

source: start
fa_ir: شروع تاریخ

source: end
fa_ir: پایان

source: description
fa_ir: توضیحات

source: user
fa_ir: کاربر

source: created on
fa_ir: ایجاد شده

source: updated on
fa_ir: بروزسانی در

source: rule
fa_ir: تکرار

source: Color event
fa_ir: رنگ رخداد

source: params
fa_ir: پارامتر

source: Editor
fa_ir: ویرایش کننده

source: Shop
fa_ir: فروشگاه

source: Percent
fa_ir: درصدی

source: Money
fa_ir: پول

source: Coupon
fa_ir: کوپن

source: Coupons
fa_ir: کوپن ها

source: Parent
fa_ir: والد

source: Categories
fa_ir: شاخه ها

source: Sample Forms Group
fa_ir: گروه فرم های نمونه

source: Sample Form Group
fa_ir: گروه فرم های نمونه

source: Sample Form Fields
fa_ir: فیلد های فرم نمونه

source: Sample Forms
fa_ir: فرم نمونه

source: Price
fa_ir: قیمت

source: Has Discount
fa_ir: تحفیف دارد؟

source: Deleted
fa_ir: حذف شده

source: Sample Form
fa_ir: فرم نمونه

source: Product
fa_ir: محصول

source: Products
fa_ir: محصولات

source: Product Image
fa_ir: عکس های محصول

source: Product Images
fa_ir: عکس های محصولات

source: File Product
fa_ir: فایل های محصول

source: File Products
fa_ir: فایل های محصول

source: Sender
fa_ir: ارسال کننده

source: Product Comment
fa_ir: دیدگاه محصول

source: Product Comments
fa_ir: دیدگاه محصول

source: Product comment
fa_ir: دیدگاه محصول

source: Basket
fa_ir: سبد

source: Invoice
fa_ir: رسید خرید

source: Invoices
fa_ir: رسید خرید

source: Invoice Product
fa_ir: صورتحساب محصول

source: Product Sample Form Fields
fa_ir: فیلدهای فرم نمونه محصول

source: Link
fa_ir: لینک

source: Shop Slider
fa_ir: اسلایدر فروشگاه

source: Shop Sliders
fa_ir: اسلایدر فروشگاه

source: Users
fa_ir: کاربرها

source: Password
fa_ir: گذر واژه

source: Last visit
fa_ir: اخرین بازدید

source: Base User
fa_ir: کاربر

source: Coach Level
fa_ir: سطح

source: Coach Levels
fa_ir: سطوح

source: Home
fa_ir: خانه

source: Add
fa_ir: آدرس

source: Change
fa_ir: تغییر دادن

source: New
fa_ir: افزودن

source: Please correct the error below.
fa_ir: لطفا خطای زیر را تصحیح کنید.

source: Please correct the errors below.
fa_ir: لطفا خطاهای زیر را تصحیح کنید.

source: Tools
fa_ir: ابزارها

source: History
fa_ir: تاریخچه

source: View on site
fa_ir: مشاهد سایت

source: Dashboard
fa_ir: داشبورد

source: View site
fa_ir: مشاهد سایت

source: Administration
fa_ir: مدیریت

source: Documentation
fa_ir: مستندات

source: Change password
fa_ir: تغییر گذر واژه

source: Log out
fa_ir: خروج

source: Log in
fa_ir: ورود

source: Delete
fa_ir: پاک کردن

source: Today
fa_ir: امروز

source: Now
fa_ir: هم اکنون

source: Change selected %(bound_field_urls.model)s
fa_ir: %(bound_field_urls.model)s ویرایش

source: Add another %(bound_field_urls.model)s
fa_ir: افزودن %(bound_field_urls.model)s

source: Delete selected %(bound_field_urls.model)s
fa_ir: حذف %(bound_field_urls.model)s
