from apps.schedule.models.annual import AnnualEvents

HIJRI = [
    {
        "date": "1/1",
        "event": "آغاز نوروز (تعطیل)"
    },
    {
        "date": "2/1",
        "event": "عید نوروز - تهاجم ماموران پهلوی به مدرسه فیضیه قم (1342هـ.ش) - آغاز عملیات فتح المبین (1361هـ.ش) (تعطیل)"
    },
    {
        "date": "3/1",
        "event": "عید نوروز (تعطیل)"
    },
    {
        "date": "4/1",
        "event": "عید نوروز (تعطیل)"
    },
    {
        "date": "6/1",
        "event": "روز امید ، روزشادباش نویسی"
    },
    {
        "date": "10/1",
        "event": "جشن آبانگاه"
    },
    {
        "date": "12/1",
        "event": "روز جمهوری اسلامی ایران (تعطیل)"
    },
    {
        "date": "13/1",
        "event": "روز طبیعت (تعطیل)"
    },
    {
        "date": "17/1",
        "event": "سروش روز ، جشن سروشگان"
    },
    {
        "date": "19/1",
        "event": "شهادت آیت الله سید محمد باقر صدر و خواهر ایشان بنت الهدی توسط حکومت بعث عراق (1359هـ.ش) - فروردین روز ، جشن         فروردینگان"
    },
    {
        "date": "20/1",
        "event": "روز ملّی فن آوری هسته ای"
    },
    {
        "date": "21/1",
        "event": "روز هنر انقلاب اسلامی ، شهادت امیر سپهبد علی سیاد شیرازی (1378هـ.ش)"
    },
    {
        "date": "25/1",
        "event": "روز بزرگداشت عطار نیشابوری"
    },
    {
        "date": "29/1",
        "event": "روز ارتش جمهوری اسلامی و نیروی زمینی"
    },
    {
        "date": "1/2",
        "event": "روز بزرگداشت سعدی"
    },
    {
        "date": "2/2",
        "event": "تاسیس سپاه پاسداران انقلاب اسلامی (1358هـ.ش) - سالروز اعلام انقلاب فرهنگی (1359هـ.ش) - جشن گیاه آوری ، روز زمین         پاک"
    },
    {
        "date": "3/2",
        "event": "روز بزرگداشت شیخ بهایی"
    },
    {
        "date": "5/2",
        "event": "شکست حمله ی نظامی آمریکا با ایران در طبس (1359هـ.ش)"
    },
    {
        "date": "9/2",
        "event": "روز شوراها"
    },
    {
        "date": "10/2",
        "event": "روز ملی خلیج فارس - آغاز عملیات بیت المقدس (1361هـ.ش) - جشن چهل ام نوروز"
    },
    {
        "date": "12/2",
        "event": "شهادت استاد مرتضی مطهری (1358هـ.ش) روز معلم"
    },
    {
        "date": "15/2",
        "event": "روز بزرگداشت شیخ صدوق - جشن میانه بهار ، جشن بهاربد"
    },
    {
        "date": "24/2",
        "event": "لغو امتیاز تنباکو به فتوای آیت الله میرزا حسن شیرازی (1270)"
    },
    {
        "date": "25/2",
        "event": "روز بزرگداشت فردوسی"
    },
    {
        "date": "27/2",
        "event": "روز ارتباطات و روابط عمومی"
    },
    {
        "date": "28/2",
        "event": "روز بزرگداشت حکیم عمر خیام"
    },
    {
        "date": "1/3",
        "event": "روز بهره وری و بهینه سازی مصرف - روز بزرگداشت ملاصدرا"
    },
    {
        "date": "3/3",
        "event": "فتح خرمشهر در عملیات بیت المقدس ( 1361 هـ.ش) - روز مقاومت ایثار و پیروزی"
    },
    {
        "date": "4/3",
        "event": "روز مقاومت و پایداری"
    },
    {
        "date": "6/3",
        "event": "خرداد روز ، جشن خردادگان"
    },
    {
        "date": "13/3",
        "event": "تیر روز ، جشن تیرگان"
    },
    {
        "date": "14/3",
        "event": "رحلت امام خمینی (ره) رهبر کبیر انقلاب و بنیانگذار جمهوری اسلامی ایران (1368 هـ.ش) - انتخاب آیت الله خامنه ای به         رهبری (1368 هـ.ش) (تعطیل)"
    },
    {
        "date": "15/3",
        "event": "قیام خونین 15 خرداد (1342 هـ.ش) (تعطیل)"
    },
    {
        "date": "20/3",
        "event": "شهادت آیت الله سعیدی به دست مأموران ستم شاهی (1349 هـ.ش)"
    },
    {
        "date": "29/3",
        "event": "درگذشت دکتر علی شریعتی (1356 هـ.ش)"
    },
    {
        "date": "30/3",
        "event": "انفجار در حرم حضرت امام رضا (ع) به دست ایادی امریکا (1373 هـ.ش)"
    },
    {
        "date": "31/3",
        "event": "روز بسیج اساتید و شهادت دکتر مصطفی چمران (1360 هـ.ش)"
    },
    {
        "date": "1/4",
        "event": "روز تبلیغ و اطلاع رسانی دینی ، سالروز صدور فرمان امام خمینی (ره) مبنی بر تاسیس سازمان تبلیغات اسلامی (1360 هـ.ش)         - روز اصناف - جشن آب پاشونک و آغاز تابستان"
    },
    {
        "date": "7/4",
        "event": "شهادت مظلومانه ی آیت الله دکتر بهشتی و 72 تن از یاران امام خمینی (ره) با انفجار بمب منافقان در دفتر مرکزی حزب         جمهوری اسلامی (1360 هـ.ش) - روز قوه ی قضائیه"
    },
    {
        "date": "8/4",
        "event": "روز مبارزه با سلاح های شیمیایی و میکروبی"
    },
    {
        "date": "10/4",
        "event": "روز صنعت و معدن"
    },
    {
        "date": "11/4",
        "event": "شهادت آیت الله صدوقی چهارمین شهید محراب به دست منافقان (1361 هـ.ش)"
    },
    {
        "date": "12/4",
        "event": "حمله به هواپیمای مسافربری جمهوری اسلامی ایران توسط ناوگان آمریکای جنایتکار (1368 هـ.ش)"
    },
    {
        "date": "13/4",
        "event": "سالروز درگذشت دکتر معین"
    },
    {
        "date": "14/4",
        "event": "روز قلم ، تولد حضرت امام خمینی (ره)"
    },
    {
        "date": "15/4",
        "event": "جشن خام خواری"
    },
    {
        "date": "16/4",
        "event": "روز مالیات"
    },
    {
        "date": "21/4",
        "event": "روز عفاف و حجاب (سالروز قیام مردم مشهد علیه کشف حجاب و کشتار مسجد گوهرشاد توسّط مأموران حکومت رضاخان) (1314         هـ.ش)"
    },
    {
        "date": "25/4",
        "event": "روز بهزیستی و تامین اجتماعی"
    },
    {
        "date": "27/4",
        "event": "اعلام پذیرش قطعنامه 598 شورای امنیت از سوی ایران (1368 هـ.ش)"
    },
    {
        "date": "5/5",
        "event": "سالروز عملیات افتخار آفرین مرصاد (1367 هـ.ش)"
    },
    {
        "date": "6/5",
        "event": "روز ترویج آموزش های فنی و حرفه ای"
    },
    {
        "date": "7/5",
        "event": "مرداد روز ، جشن مردادگان"
    },
    {
        "date": "8/5",
        "event": "روز بزرگداشت شیخ شهاب الدین سهروردی"
    },
    {
        "date": "9/5",
        "event": "روز اهدای خون"
    },
    {
        "date": "10/5",
        "event": "جشن چله تابستان"
    },
    {
        "date": "14/5",
        "event": "صدور فرمان مشروطیت"
    },
    {
        "date": "16/5",
        "event": "تشکیل جهاد دانشگاهی (1359 هـ.ش)"
    },
    {
        "date": "17/5",
        "event": "روز خبرنگار"
    },
    {
        "date": "28/5",
        "event": "کودتای آمریکا برای باز گرداندن شاه (1332 هـ.ش)"
    },
    {
        "date": "30/5",
        "event": "روز بزرگداشت علامه مجلسی"
    },
    {
        "date": "1/6",
        "event": "روز بزرگداشت بوعلی سینا و روز پزشک"
    },
    {
        "date": "2/6",
        "event": "آغاز هفته دولت"
    },
    {
        "date": "4/6",
        "event": "روز کارمند - زادروز داراب (کوروش) - شهریور روز ، جشن شهریورگان"
    },
    {
        "date": "5/6",
        "event": "روز بزرگداشت محمد بن زکریای رازی و روز داروسازی"
    },
    {
        "date": "8/6",
        "event": "روز مبارزه با تروریسم ، انفجار دفتر نخست وزیری به دست منافقان و شهادت مظلومانه رجائی و باهنر (1360 هـ.ش)"
    },
    {
        "date": "10/6",
        "event": "روز بانکداری اسلامی ، سالروز تصویب قانون عملیات بانکی بدون ربا (1362 هـ.ش)"
    },
    {
        "date": "11/6",
        "event": "روز صنعت چاپ"
    },
    {
        "date": "12/6",
        "event": "روز مبارزه با استعمار انگلیس"
    },
    {
        "date": "13/6",
        "event": "روز بزرگداشت ابوریحان بیرونی ، روز تعاون"
    },
    {
        "date": "14/6",
        "event": "روز اکرام - شهادت آیت الله قدوسی و سرتیب وحید دستجردی (1360 هـ.ش)"
    },
    {
        "date": "17/6",
        "event": "قیام 17 شهریور و کشتار جمعی به دست ماموران ستم شاهی پهلوی (1357 هـ.ش)"
    },
    {
        "date": "19/6",
        "event": "وفات آیت الله سید محمود طالقانی اولین امام جمه تهران (1358 ه .ش)"
    },
    {
        "date": "20/6",
        "event": "شهادت دومین شهید محراب آیت الله مدنی به دست منافقین (1360 هـ.ش)"
    },
    {
        "date": "21/6",
        "event": "روز سینما"
    },
    {
        "date": "27/6",
        "event": "روز بزرگداشت شهریار و شعر و ادب فارسی"
    },
    {
        "date": "31/6",
        "event": "آغاز جنگ تحمیلی (1359 هـ.ش) - آغاز هفته ی دفاع مقدس"
    },
    {
        "date": "5/7",
        "event": "شکست حصر آبادان در عملیات ثامن الائمه (ع) (1360 هـ.ش)"
    },
    {
        "date": "7/7",
        "event": "روز آتش نشانی و ایمنی"
    },
    {
        "date": "8/7",
        "event": "روز بزرگداشت مولوی"
    },
    {
        "date": "9/7",
        "event": "روز همبستگی با کودکان و نوجوانان فلسطینی"
    },
    {
        "date": "13/7",
        "event": "هجرت حضرت امام خمینی (ره) از عراق به پاریس (1357 هـ.ش) - روز نیروی انتظامی"
    },
    {
        "date": "14/7",
        "event": "روز دامپزشکی"
    },
    {
        "date": "16/7",
        "event": "مهر روز ، جشن مهرگان"
    },
    {
        "date": "20/7",
        "event": "روز بزرگداشت حافظ ، روز ملی کاهش اثرات بلایای طبیعی"
    },
    {
        "date": "21/7",
        "event": "جشن پیروزی کاوه و فریدون"
    },
    {
        "date": "23/7",
        "event": "شهادت پنجمین شهید محراب آیت الله اشرفی اصفحانی (1361 هـ.ش)"
    },
    {
        "date": "24/7",
        "event": "روز پیوند اولیاء و مربیان"
    },
    {
        "date": "26/7",
        "event": "روز تربیت بدنی و ورزش"
    },
    {
        "date": "29/7",
        "event": "روز صادرات"
    },
    {
        "date": "1/8",
        "event": "روز آمار و برنامه‌ریزی"
    },
    {
        "date": "4/8",
        "event": "اعتراض و افشاگری حضرت امام خمینی (ره) علیه پذیرش کاپیتولاسیون (1343 هـ.ش)"
    },
    {
        "date": "8/8",
        "event": "روز نوجوان"
    },
    {
        "date": "10/8",
        "event": "شهادت آیت الله قاضی طباطبائی اولین شهید محراب به دست منافقین (1358 هـ.ش) - آبان روز ، جشن آبانگان"
    },
    {
        "date": "13/8",
        "event": "تسخیر لانه ی جاسوسی آمریکا به دست دانشجویان (1358 هـ.ش) - روز ملی مبارزه با استکبار جهانی - روز دانش آموز"
    },
    {
        "date": "14/8",
        "event": "روز فرهنگ عمومی"
    },
    {
        "date": "15/8",
        "event": "جشن میانه پاییز"
    },
    {
        "date": "18/8",
        "event": "روز ملی کیفیت"
    },
    {
        "date": "24/8",
        "event": "روز کتاب و کتاب خوانی - روز بزرگداشت آیت الله علامه سید محمد حسین طباطبائی (1360 هـ.ش)"
    },
    {
        "date": "1/9",
        "event": "آذر جشن"
    },
    {
        "date": "5/9",
        "event": "روز بسیج مستضعفان ، تشکیل بسیج مستضعفان به فرمان حضرت امام خمینی (ره) (1358 هـ.ش)"
    },
    {
        "date": "7/9",
        "event": "روز نیروی دریایی"
    },
    {
        "date": "9/9",
        "event": "روز بزرگداشت شیخ مفید - آذر روز، جشن آذرگان"
    },
    {
        "date": "10/9",
        "event": "شهادت آیت الله سید حسن مدرس (1316 هـ.ش) - روز مجلس"
    },
    {
        "date": "12/9",
        "event": "تصویب قانون اساسی جمهوری اسلامی ایران (1358 هـ.ش)"
    },
    {
        "date": "13/9",
        "event": "روز بیمه"
    },
    {
        "date": "16/9",
        "event": "روز دانشجو"
    },
    {
        "date": "18/9",
        "event": "معرفی عراق به عنوان مسئول و آغازگر جنگ از سوی سازمان ملل (1370 هـ.ش)"
    },
    {
        "date": "19/9",
        "event": "تشکیل شورای عالی انقلاب فرهنگی به فرمان حضرت امام خمینی (ره) (1363 هـ.ش)"
    },
    {
        "date": "20/9",
        "event": "شهادت آیت الله دستغیب سومین شهید محراب به دست منافقین (1360 هـ.ش)"
    },
    {
        "date": "25/9",
        "event": "روز پژوهش"
    },
    {
        "date": "26/9",
        "event": "روز حمل و نقل"
    },
    {
        "date": "27/9",
        "event": "شهادت آیت الله دکتر محمد مفتح (1358 هـ.ش) - روز وحدت حوزه و دانشگاه"
    },
    {
        "date": "30/9",
        "event": "جشن شب یلدا"
    },
    {
        "date": "1/10",
        "event": "روز میلاد خورشید ، جشن خرم روز، نخستین جشن دیگان"
    },
    {
        "date": "7/10",
        "event": "سالروز تشکیل نهضت سواد آموزی (1358 هـ.ق)"
    },
    {
        "date": "8/10",
        "event": "دی به آذر روز، دومین جشن دیگان"
    },
    {
        "date": "9/10",
        "event": "روز بصیرت و میثاق امت با ولایت (سالروز حماسه ی ملّت در 9 دی پس از فتنه ی 1388 هـ.ش)"
    },
    {
        "date": "14/10",
        "event": "روز جهاد کشاورزی"
    },
    {
        "date": "15/10",
        "event": "روز خانواده - تکریم بازنشستگان - دی به 7 روز، سومین جشن دیگان"
    },
    {
        "date": "17/10",
        "event": "درگذشت مشکوک جهان پهلوان تختی"
    },
    {
        "date": "19/10",
        "event": "قیام خونین مردم قم (1356 هـ.ش) - آغاز عملیات کربلای 5 (1365 هـ.ش)"
    },
    {
        "date": "20/10",
        "event": "شهادت میرزاتقی خان امیر کبیر (1230 هـ.ش)"
    },
    {
        "date": "22/10",
        "event": "تشکیل شورای انقلاب به فرمان حضرت امام خمینی (ره) (1357 هـ.ش)"
    },
    {
        "date": "23/10",
        "event": "دی به دین روز ، چهارمین جشن دیگان"
    },
    {
        "date": "26/10",
        "event": "فرار شاه معدوم (1357 هـ.ش)"
    },
    {
        "date": "29/10",
        "event": "روز غزه"
    },
    {
        "date": "1/11",
        "event": "زادروز فردوسی"
    },
    {
        "date": "2/11",
        "event": "بهمن روز، جشن بهمنگان"
    },
    {
        "date": "5/11",
        "event": "جشن نوسره"
    },
    {
        "date": "12/11",
        "event": "بازگشت حضرت امام خمینی (ره) به ایران (1357) - آغاز دهه مبارک فجر انقلاب اسلامی"
    },
    {
        "date": "15/11",
        "event": "جشن میانه زمستان"
    },
    {
        "date": "18/11",
        "event": "روز ملی فناوری فضایی"
    },
    {
        "date": "19/11",
        "event": "روز نیروی هوایی"
    },
    {
        "date": "22/11",
        "event": "پیروزی انقلاب اسلامی و سقوط نظام شاهنشاهی (1357 هـ.ش) (تعطیل)"
    },
    {
        "date": "29/11",
        "event": "قیام مردم تبریز به مناسبت چهلمین روز شهادت شهدای قم (1356 هـ.ش) - جشن سپندارمذگان ، روز عشق"
    },
    {
        "date": "5/12",
        "event": "روز بزرگداشت خواجه نصیرالدین طوسی - جشن اسفندگان"
    },
    {
        "date": "8/12",
        "event": "روز امور تربیتی و تربیت اسلامی"
    },
    {
        "date": "9/12",
        "event": "روز حمایت از حقوق مصرف کنندگان"
    },
    {
        "date": "14/12",
        "event": "روز احسان و نیکوکاری"
    },
    {
        "date": "15/12",
        "event": "روز درختکاری"
    },
    {
        "date": "16/12",
        "event": "روز وقف"
    },
    {
        "date": "22/12",
        "event": "روز بزرگداشت شهدا"
    },
    {
        "date": "25/12",
        "event": "بمباران شیمیایی حلبچه توسط ارتش بعثی عراق (1366 هـ.ق) - روز بزرگداشت پروین اعتصامی - پایان سرایش شاهنامه"
    },
    {
        "date": "29/12",
        "event": "روز ملی شدن صنعت نفت ایران (1329 هـ.ش) (تعطیل)"
    },
    {
        "date": "30/12",
        "event": "این روز فقط در سال های کبیسه وجود دارد و معمولاً تعطیل اعلام می گردد"
    }
]

ISLAMIC = [
    {
        "date": "1/1",
        "event": "آغاز سال هجری قمری"
    },
    {
        "date": "9/1",
        "event": "تاسوعای حسینی (تعطیل)"
    },
    {
        "date": "10/1",
        "event": "عاشورای حسینی (تعطیل)"
    },
    {
        "date": "11/1",
        "event": "روز تجلیل از اسرا و مفقودان"
    },
    {
        "date": "12/1",
        "event": "شهادت حضرت امام زین العابدین (ع) (95 هـ.ق)"
    },
    {
        "date": "18/1",
        "event": "تغییر قبله مسلمین از بیت المقدس به مکه معظمه (52 هـ.ق)"
    },
    {
        "date": "25/1",
        "event": "شهادت حضرت امام زین العابدین (ع) (95 هـ.ق) به روایتی"
    },
    {
        "date": "3/2",
        "event": "ولادت حضرت امام محمد باقر (ع) (57 هـ.ق)"
    },
    {
        "date": "7/2",
        "event": "ولادت حضرت امام موسی کاظم (ع) (128 هـ.ق)"
    },
    {
        "date": "20/2",
        "event": "اربعین حسینی (تعطیل)"
    },
    {
        "date": "28/2",
        "event": "رحلت حضرت رسول اکرم (ص) (11 هـ.ق) - شهادت حضرت امام حسن مجتبی (ع) (50 هـ.ق) (تعطیل)"
    },
    {
        "date": "29/2",
        "event": "شهادت حضرت امام رضا (ع) (203 هـ.ق) (تعطیل)"
    },
    {
        "date": "1/3",
        "event": "هجرت حضرت رسول اکرم (ص) از مکه به مدینه (اول محرم سال هجرت ، مبدا گاه شماری هجری قمری)"
    },
    {
        "date": "8/3",
        "event": "شهادت حضرت امام حسن عسگری (ع) (260 هـ.ق) و آغاز ولایت حضرت ولی‌عصر(عج)"
    },
    {
        "date": "12/3",
        "event": "میلاد حضرت رسول اکرم (ص) به روایت اهل سنت (53 سال قبل از هجرت) - آغاز هفته ی وحدت"
    },
    {
        "date": "17/3",
        "event": "میلاد حضرت رسول اکرم (ص) (53 سال قبل از هجرت) - میلاد حضرت امام جعفر صادق (ع) (تعطیل)"
    },
    {
        "date": "8/4",
        "event": "ولادت حضرت امام حسن عسگری (ع) (232 هـ.ق)"
    },
    {
        "date": "10/4",
        "event": "وفات حضرت معصومه (س) (201 هـ.ق)"
    },
    {
        "date": "5/5",
        "event": "ولادت حضرت زینب (س) (5 هـ.ق) - روز پرستار"
    },
    {
        "date": "13/5",
        "event": "شهادت حضرت فاطمه زهرا (س) (11 هـ.ق) به روایتی"
    },
    {
        "date": "3/6",
        "event": "شهادت حضرت فاطمه زهرا (س) (11 هـ.ق) (تعطیل)"
    },
    {
        "date": "20/6",
        "event": "ولادت حضرت فاطمه زهرا (س) (8 سال قبل از هجرت) - روز زن"
    },
    {
        "date": "1/7",
        "event": "ولادت حضرت امام محمد باقر (ع) (57 هـ.ق)"
    },
    {
        "date": "3/7",
        "event": "شهادت امام علی النقی الهادی (ع) (254 هـ.ق)"
    },
    {
        "date": "10/7",
        "event": "ولادت حضرت امام محمد تقی (ع) (جواد الائمه) (195 هـ.ق)"
    },
    {
        "date": "13/7",
        "event": "ولادت حضرت امام علی (ع) (23 سال قبل از هجرت) - آغاز ایام البیض (اعتکاف) (تعطیل)"
    },
    {
        "date": "15/7",
        "event": "وفات حضرت زینب (س) (62 هـ.ق)"
    },
    {
        "date": "25/7",
        "event": "شهادت امام موسی کاظم (ع) (183 هـ.ق)"
    },
    {
        "date": "27/7",
        "event": "مبعث رسول اکرم (ص) (13 سال قبل از هجرت) (تعطیل)"
    },
    {
        "date": "3/8",
        "event": "ولادت حضرت امام حسین (ع) (4 هـ.ق) - روز پاسدار"
    },
    {
        "date": "4/8",
        "event": "ولادت حضرت ابوالفضل (ع) (26 هـ.ق) - روز جانباز"
    },
    {
        "date": "5/8",
        "event": "ولادت حضرت امام زین العابدین (ع) (381 هـ.ق)"
    },
    {
        "date": "11/8",
        "event": "ولادت حضرت علی اکبر (ع) (33 هـ.ق) - روز جوان"
    },
    {
        "date": "15/8",
        "event": "ولادت حضرت قائم (عج) (255 هـ.ق) - روز جهانی مستضعفان (تعطیل)"
    },
    {
        "date": "10/9",
        "event": "وفات حضرت خدیجه (س) (3 سال قبل از هجرت)"
    },
    {
        "date": "15/9",
        "event": "ولادت حضرت امام حسن مجتبی (ع) (3 هـ.ق)"
    },
    {
        "date": "18/9",
        "event": "شب قدر"
    },
    {
        "date": "19/9",
        "event": "ضربت خوردن حضرت علی (ع) (40 هـ.ق)"
    },
    {
        "date": "20/9",
        "event": "شب قدر"
    },
    {
        "date": "21/9",
        "event": "شهادت حضرت علی (ع) (40 هـ.ق) (تعطیل)"
    },
    {
        "date": "22/9",
        "event": "شب قدر"
    },
    {
        "date": "1/10",
        "event": "عید سعید فطر (تعطیل)"
    },
    {
        "date": "25/10",
        "event": "شهادت حضرت امام جعفر صادق (ع) (148 هـ.ق) (تعطیل)"
    },
    {
        "date": "1/11",
        "event": "ولادت حضرت معصومه (س) (173 هـ.ق) - روز دختر"
    },
    {
        "date": "11/11",
        "event": "ولادت حضرت امام رضا (ع) (148 هـ.ق)"
    },
    {
        "date": "30/11",
        "event": "شهادت حضرت امام محمد تقی (ع) (جواد الائمه)"
    },
    {
        "date": "1/12",
        "event": "سالروز ازدواج حضرت علی (ع) و حضرت فاطمه (س) (2 هـ.ق) - روز ازدواج و خانواده"
    },
    {
        "date": "7/12",
        "event": "شهادت حضرت امام محمد باقر (ع) (114 هـ.ق)"
    },
    {
        "date": "10/12",
        "event": "عید سعید قربان (تعطیل)"
    },
    {
        "date": "15/12",
        "event": "ولادت امام علی النقی الهادی (ع) (212 هـ.ق)"
    },
    {
        "date": "18/12",
        "event": "عید سعید غدیر خم (10 هـ.ق) (تعطیل)"
    },
    {
        "date": "24/12",
        "event": "روز مباهله پیامبر اسلام (ص)"
    }
]

AD = [
    {
        "date": "1/1",
        "event": "آغاز سال میلادی"
    },
    {
        "date": "1/2",
        "event": "روز جهانی حجاب (روز همبستگی با بانوان محجّبه)"
    },
    {
        "date": "8/3",
        "event": "روز جهانی زن"
    },
    {
        "date": "22/3",
        "event": "روز جهانی آب"
    },
    {
        "date": "23/3",
        "event": "روز جهانی هواشناسی"
    },
    {
        "date": "7/4",
        "event": "روز سلامتی (روز جهانی بهداشت)"
    },
    {
        "date": "1/5",
        "event": "روز جهانی کار و کارگر"
    },
    {
        "date": "5/5",
        "event": "روز جهانی ماما"
    },
    {
        "date": "8/5",
        "event": "روز جهانی صلیب سرخ و هلال احمر"
    },
    {
        "date": "15/5",
        "event": "روز جهانی خانواده"
    },
    {
        "date": "17/5",
        "event": "روز جهانی ارتباطات"
    },
    {
        "date": "18/5",
        "event": "روز جهانی موزه و میراث فرهنگی"
    },
    {
        "date": "21/5",
        "event": "روز جهانی توسعه فرهنگی"
    },
    {
        "date": "31/5",
        "event": "روز جهانی بدون دخانیات"
    },
    {
        "date": "5/7",
        "event": "روز جهانی محیط زیست"
    },
    {
        "date": "10/7",
        "event": "روز جهانی صنایع دستی"
    },
    {
        "date": "17/7",
        "event": "روز جهانی بیابان زدایی"
    },
    {
        "date": "26/7",
        "event": "روز جهانی مبارزه با مواد مخدر"
    },
    {
        "date": "1/8",
        "event": "روز جهانی شیر مادر"
    },
    {
        "date": "21/8",
        "event": "روز جهانی مسجد"
    },
    {
        "date": "27/9",
        "event": "روز جهانی جهانگردی"
    },
    {
        "date": "30/9",
        "event": "روز جهانی ناشنوایان ، روز جهانی دریا نوردی"
    },
    {
        "date": "1/10",
        "event": "روز جهانی سالمندان"
    },
    {
        "date": "8/10",
        "event": "روز جهانی کودک"
    },
    {
        "date": "9/10",
        "event": "روز جهانی پست"
    },
    {
        "date": "14/10",
        "event": "روز جهانی استاندارد"
    },
    {
        "date": "15/10",
        "event": "روز جهانی نابینایان (عصای سفید)"
    },
    {
        "date": "16/10",
        "event": "روز جهانی غذا"
    },
    {
        "date": "29/10",
        "event": "روز جهانی بزرگداشت کورش کبیر"
    },
    {
        "date": "1/12",
        "event": "روز جهانی مبارزه با ایدز"
    },
    {
        "date": "3/12",
        "event": "روز جهانی معلولان"
    },
    {
        "date": "7/12",
        "event": "روز جهانی هواپیمایی"
    },
    {
        "date": "25/12",
        "event": "میلاد حضرت مسیح (ع)"
    }
]


class SampleDate(object):

    @staticmethod
    def hijri_date():
        AnnualEvents.objects.filter(date_type="HIJRI", insert_type="SYSTEM").delete()
        for date in HIJRI:
            date_time = date["date"].split('/')
            date_model = AnnualEvents()
            date_model.date_type = "HIJRI"
            date_model.insert_type = "SYSTEM"
            date_model.day = int(date_time[0])
            date_model.month = int(date_time[1])
            date_model.title = date["event"]
            date_model.save()

        return "Hijri date complete"

    @staticmethod
    def islamic_date():
        AnnualEvents.objects.filter(date_type="ISLAMIC", insert_type="SYSTEM").delete()
        for date in ISLAMIC:
            date_time = date["date"].split('/')
            date_model = AnnualEvents()
            date_model.date_type = "ISLAMIC"
            date_model.insert_type = "SYSTEM"
            date_model.day = int(date_time[0])
            date_model.month = int(date_time[1])
            date_model.title = date["event"]
            date_model.save()

        return "Islamic date complete"

    @staticmethod
    def ad_date():
        AnnualEvents.objects.filter(date_type="AD", insert_type="SYSTEM").delete()
        for date in AD:
            date_time = date["date"].split('/')
            date_model = AnnualEvents()
            date_model.date_type = "AD"
            date_model.insert_type = "SYSTEM"
            date_model.day = int(date_time[0])
            date_model.month = int(date_time[1])
            date_model.title = date["event"]
            date_model.save()

        return "Ad date complete"
